import React from 'react';

const HowReactWork = () => {
    return (
        <div className = "container mt-4 mb-3">
            <h5><strong>রিয়্যাক্ট কিভাবে কাজ করে?</strong></h5>
            <p>রিয়্যাক্ট হলো একটা জাভাস্ক্রিপ্ট লাইব্রেরি। রিয়্যাক্ট কাজ করার জন্য আমাদের দুটি প্যাকেজ এর দরকার হবে। প্রথমত রিয়্যাক্ট এবং রিয়্যাক্ট ডম। আমরা জখন একটা কম্পনেন্ট লিখি তখন সেটা পিওর জাভাস্ক্রিপ্ট এ লিখি হয় সেটা ফাংশন নয়ত ক্লাস। আর এই কম্পনেন্ট এ আমরা JSX  ব্যাবহার করবো। আর এই কম্পনেন্ট কে HTML কোড এ কনভার্ট করতে হয় কারন আমরা অয়েব পেজ এ যা দেখি তাই HTML কোড। আর এই কাজ টা রিয়্যাক্ট করে। আর এই কোড কে HTML ফাইল এর মধ্যে রিয়্যাক্ট ডম ইঞ্জেক্ট করে তাও খুব ই দ্রুত এবং অয়েবপেজ লোড করা ব্যাতিত।</p>
        </div>
    );
};

export default HowReactWork;