import React from 'react';

const PropsVsState = () => {
    return (
        <div className = "container">
            <h5><strong>প্রপ্স এবং স্ট্যাট এর মধ্যে পার্থক্যঃ</strong></h5>
            <p><strong>প্রপ্সঃ</strong> প্রপ্স প্রপার্টি নামে অধিক পরিচিত। এটা এক কম্পনেন্ট থেকে অপর কম্পনেন্ট এ ডাটা পাঠানোর কাজে ব্যাবহার করা হয়। এতা আপডেট বা পরিবর্তন করা যায় না এটা কেবল রিড অনলি এবং অপরিবর্তনীয় ভ্যালু । </p>
            <p><strong>স্ট্যাটঃ</strong>ওয়েব পেজ এ কোনো ডাটা পরিবর্তনশীল হলে অর্থাৎ পরিবর্তন হতেও পারে এমন এই অবস্থায় আমরা স্ট্যাট ব্যবহার করি। স্ট্যাট এর ডাটা পরিবর্তন করা যায় আপডেট করা যায় এবং এটা কেবল যে কম্পনেন্টএ ডিকলেয়ার করা হয় সেখানেই ব্যবহার করা যায়।</p>
        </div>
    );
};

export default PropsVsState;